Autodesk.Revit.DB.ConnectionValidationWarning.GetParts
Get ElementIds of affected parts.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2016

Autodesk.Revit.DB.ConnectionValidationWarning.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ConnectionValidationWarning.Reason
Enumeration for reason of warning.
Since:
2016

Autodesk.Revit.DB.ConnectionValidationWarning.Resolution
Enumeration for resolution that was applied.
Since:
2016

Autodesk.Revit.DB.ConnectionValidationWarning.#ctor(Autodesk.Revit.DB.ConnectionResolution,Autodesk.Revit.DB.ConnectionWarning,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Constructor.
resolution:
Resolution type.
reason:
Warning reason.
part1:
First element Id.
part2:
Second element Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.ConnectionValidationWarning
Contains information about a specific connection validation problem.
Since:
2016